[error]
1=卡未初始化或找不到卡!
2=復位失敗!
3=卡版本不對!
4=報警!
6=執行失敗!
7=狀態不對應!
16=命令超時!
17=命令丟失!
18=接口調用不同步!
19=接口被其他程式佔用!
20=Z軸超限或校正文件損壞!
21=參數不匹配!
23=記憶體分配失敗!
100=脫機使用中!
101=命令被中止!
1001=端口1
1002=端口2
1003=端口3
1004=端口4
1005=端口5
1006=端口6
1007=端口7
1008=激光輸入沒有準備好
1009=激光輸入準備就緒

[4]
1 = 雷射器過溫，請關閉電源！
2 = 雷射器高反報警，請關閉電源！
3 = 雷射器MO異常，請關閉電源！
4 = 雷射器蓋子被打開，請關閉電源並裝好雷射器蓋子！
5 = 安全門被打開，請關上安全門！
6 = 光閘關閉異常，請關閉電源並檢查光閘！
7 = 光閘打開異常，請關閉電源並檢查光閘！
8 = 安全門被打開，打標暫停，請關上安全門繼續打標！
9 = 安全門被打開，打標中止！
10= 雷射器系統報警，請關閉電源！
11= 雷射器電源電壓超範圍，請關閉電源！
12= 雷射器電源過壓報警，請關閉電源並檢查雷射器電源！
13= 雷射器電源欠壓報警，請關閉電源並檢查雷射器電源！
14= SPI雷射器過溫報警，請關閉電源！
15= SPI雷射器預備放大器過流報警，請關閉電源！
16= SPI雷射器功率放大器過流報警，請關閉電源！
17= SPI雷射器准直雷射器報警，請關閉電源！
18= SPI雷射器保留報警，請關閉電源！
19= SPI雷射器電源報警，請關閉電源！
20= 雷射器未知報警，請關閉電源！
21= 雷射器電源過流報警，請關閉電源！
22= 雷射器電源過壓報警，請關閉電源！
23= 雷射器電源過溫報警，請關閉電源並檢查散熱條件！
24= 雷射器電源未打開，請檢查電源。
30= 運動過程中碰到負限位，打標被中止！
31= 運動過程中碰到正限位，打標被中止！
32= 電機脈沖超範圍
33= 振鏡DA超範圍！
34= 平臺X軸超正限位！
35= 平臺X軸超負限位！
36= 平臺Y軸超正限位！
37= 平臺Y軸超負限位！
38= 振鏡方頭上電異常，請關閉電源並檢查！
54=請切換到512校正表!
55=請切換到128校正表!
100=安全門有效且被打開!

110=碰到負限位!
111=碰到正限位!
112=運動中碰到原點!
500=振鏡預熱中，請稍侯再試!

[door]
1=安全門被打開，請關上安全門！
2=安全門被打開，打標暫停，請關上安全門繼續打標！
3=安全門被打開，打標中止！
4=安全門已關上,可以繼續打標！
5=安全門已關上,狀態正常！
6=運動過程中碰到負限位，打標被中止！
7=運動過程中碰到正限位，打標被中止！

[usb]
1=EMCC卡已經連接
2=EMCC卡已經斷開


[4101]
3=DA卡1功能與版本信息
4=DA卡1版本日期信息
5=DA卡1的運行時間
7=DA卡1的誤碼幀數
9=DA卡1倒數第4次誤碼的時間
11=DA卡1倒數第3次誤碼的時間
13=DA卡1倒數第2次誤碼的時間
15=DA卡1最後壹次誤碼的時間

[4102]
4=DA卡1的失碼幀數
6=DA卡1倒數第4次失碼的時間
8=DA卡1倒數第3次失碼的時間
10=DA卡1倒數第2次失碼的時間
12=DA卡1最後壹次失碼的時間
14=DA卡1振鏡報警信息
15=DA卡1振鏡報警關激光使能

[4103]
3=DA卡2功能與版本信息
4=DA卡2版本日期信息
5=DA卡2的運行時間
7=DA卡2的誤碼幀數
9=DA卡2倒數第4次誤碼的時間
11=DA卡2倒數第3次誤碼的時間
13=DA卡2倒數第2次誤碼的時間
15=DA卡2最後壹次誤碼的時間

[4104]
4=DA卡2的失碼幀數
6=DA卡2倒數第4次失碼的時間
8=DA卡2倒數第3次失碼的時間
10=DA卡2倒數第2次失碼的時間
12=DA卡2最後壹次失碼的時間
14=DA卡2振鏡報警信息
15=DA卡2振鏡報警關激光使能

[4105]
3=LASER卡功能與版本信息
4=LASER卡版本日期信息
5=LASER卡的運行時間
7=LASER卡的誤碼幀數
9=LASER卡倒數第4次誤碼的時間
11=LASER卡倒數第3次誤碼的時間
13=LASER卡倒數第2次誤碼的時間
15=LASER卡最後壹次誤碼的時間

[4106]
4=LASER卡的失碼幀數
6=LASER卡倒數第4次失碼的時間
8=LASER卡倒數第3次失碼的時間
10=LASER卡倒數第2次失碼的時間
12=LASER卡最後壹次失碼的時間
14=LASER卡振鏡報警信息
15=LASER卡激光器報警關激光使能

[4107]
3=LASER卡激光器當前ns波形
4=LASER卡激光器當前ps波形
5=LASER卡激光器當前fs波形
6=LASER卡激光器當前維持功率



[4102Warning]
0=D0:DA卡1 數據通訊異常
1=D1:DA卡1 Scanner系統報警
2=D2:DA卡1 Scanner溫度報警
3=D3:DA卡1 Scanner低速報警
4=D4:未使用
5=D5:未使用
6=D6:未使用
7=D7:未使用
8=D8:未使用
9=D9:未使用
10=D10:未使用
11=D11:未使用
12=D12:未使用
13=D13:未使用
14=D14:未使用
15=D15:EMCC卡 數據通訊異常

[4104Warning]
0=D0:DA卡2 數據通訊異常
1=D1:DA卡2 Scanner系統報警
2=D2:DA卡2 Scanner溫度報警
3=D3:DA卡2 Scanner低速報警
4=D4:未使用
5=D5:未使用
6=D6:未使用
7=D7:未使用
8=D8:未使用
9=D9:未使用
10=D10:未使用
11=D11:未使用
12=D12:未使用
13=D13:未使用
14=D14:未使用
15=D15:未使用

[4106Warning]
0=D0:LASER卡 數據通訊異常
1=D1:激光器溫度報警
2=D2:電源報警
3=D3:系統報警
4=D4:高反報警
5=D5:激光器未準備好
6=D6:種子激光點火失敗
7=D7:種子激光溫度報警
8=D8:MO過流報警
9=D9:PA過流報警
10=D10:準直器報警
11=D11:保留報警5
12=D12:保留報警4
13=D13:保留報警3
14=D14:保留報警2
15=D15:保留報警1

[Refresh]
Interval=500

